{
    "id": "town_square",
    "title": "Tyger Tyger Square",
    "location_id": "town_center",
    "time_cost": 10,
    "text": {
        "base": "The square is an open wound in the forest. A centerpiece of gray stone and dead grass where the wind doesn't blow so much as it orbits. The statue in the center is draped in heavy black plastic that snaps and ripples with a rhythmic precision. Fog rolls through the streets like a tide, erasing the buildings from the waist down.",
        "lens": {
            "believer": "The geometry here is an insult. The streets don't intersect; they spiral *in* towards the statue, narrowing as they go, as if the town is a drain designed to catch something falling from the sky.",
            "skeptic": "The trash cans are overflowing with fresh garbage. Newspaper headlines from two days ago. Footprints in the mud that hasn't had time to settle. The town square is a stage where the actors just stepped into the wings.",
            "haunted": "You are standing on a bullseye. A dozen dark windows overlook the square like rows of unblinking eyes. You can feel the weight of their attention, cold and damp, settling on the back of your neck."
        },
        "inserts": [
            {
                "condition": {
                    "flag": "day4_birds_found"
                },
                "text": "The birds are still here. A thousand dead starlings forming three perfect concentric rings around the statue. The smell of rot is cold and sweet.",
                "insert_at": "AFTER_LENS"
            }
        ]
    },
    "connected_scenes": [
        "diner",
        "trailhead",
        "clinic_lobby"
    ],
    "choices": [
        {
            "label": "Duck into the Last Stop Diner",
            "next_scene": "diner"
        },
        {
            "label": "Follow the trail into the woods",
            "next_scene": "trailhead"
        },
        {
            "label": "[Logic] Study the movement of the statue's draping",
            "check": {
                "skill": "Logic",
                "dc": 12
            },
            "on_success": {
                "text": "The wind is blowing north-west. The plastic on the statue is rippling south. Whatever is moving under that shroud, it has its own weather.",
                "effects": [
                    {
                        "type": "sanity",
                        "value": -2
                    },
                    {
                        "type": "thought",
                        "target": "thought_statue_movement",
                        "value": true
                    }
                ]
            },
            "on_fail": {
                "text": "Wind and plastic. A chaotic system, easily misinterpreted by a tired mind."
            }
        },
        {
            "label": "[Logic - Forensics] Examine the dead birds",
            "condition": {
                "flag": "day4_birds_found"
            },
            "check": {
                "skill": "Forensics",
                "dc": 14
            },
            "on_success": {
                "text": "No rigor mortis. No external trauma. They didn't hit the ground; they were placed here. The spacing is mathematically consistent. 10cm apart. This wasn't a flock dying mid-air. It was a mosaic.",
                "effects": [
                    {
                        "type": "sanity",
                        "value": -3
                    },
                    {
                        "type": "thought",
                        "target": "thought_birds_geometry",
                        "value": true
                    }
                ]
            },
            "on_fail": {
                "text": "Mass die-off. Avian flu? Or maybe the cold snap froze them in mid-air. It's tragic, but nature is cruel."
            }
        }
    ]
}