{
    "id": "woods_clearing",
    "title": "The Whispering Clearing",
    "location_id": "woods",
    "time_cost": 10,
    "text": {
        "base": "The path ends. Not naturally, but as if the forest simply gave up. A perfect circle of dead earth, thirty feet across. The silence here has weight; it presses against the eardrums like deep water. In the center, the stone pillar waits. It doesn't look ruined. It looks like it was pushed up through the skin of the world.",
        "lens": {
            "believer": "The trees aren't just dead; they're leaning away. A radial pattern of avoidance. The air tastes like ozone and copper, the way a storm tastes before it breaks. Something is listening.",
            "skeptic": "Geiger counter activity would be high. The vegetation pattern indicates a localized soil toxicity event, likely heavy metals or subsurface leakage. The pillar is granite, standard survey marker dimensions, though the surface weathering is inconsistent with local rainfall.",
            "haunted": "It smells like the basement. Not earth—damp concrete and old ammonia. The light is too flat here, grey and buzzing, like a fluorescent tube about to fail. You've been here before. You know you have."
        },
        "inserts": [
            {
                "condition": {
                    "skill_gte": {
                        "Perception": 4
                    }
                },
                "text": "The moss stops exactly one inch from the pillar's base. It hasn't died back. It's retreated.",
                "insert_at": "AFTER_BASE"
            }
        ]
    },
    "connected_scenes": [
        "trailhead",
        "woods_north_path"
    ],
    "objects": {
        "pillar": {
            "description": "Black stone, matte finish. It drinks the light. Touching it feels wrong—not cold, but fever-warm. Damp.",
            "interactions": {
                "use": "You place your palm against the stone. The heat is immediate, invasive. It travels up your wrist, settling in the jaw. A vibration, low and constant. Like a generator running far underground."
            }
        },
        "grass": {
            "description": "Yellow. Brittle. It doesn't bend under your boots; it snaps. The sound is too loud in the quiet."
        }
    },
    "passive_clues": [
        {
            "clue_id": "clue_pillar_scratches",
            "visible_when": {
                "skill_gte": {
                    "Perception": 4
                }
            }
        }
    ],
    "ambient_effects": {
        "sanity_drain_per_min": 0.1,
        "paranoia_multiplier": 1.2
    },
    "memory_trigger": {
        "skill": "Subconscious",
        "dc": 14,
        "text": "Movement in the periphery. A child's yellow coat, bright against the grey. Then a sound—wet and heavy, like dropped meat. When you turn, the clearing is empty."
    },
    "choices": [
        {
            "label": "Examine the pillar's surface",
            "next_scene": "woods_clearing",
            "effects": [
                {
                    "type": "sanity",
                    "value": -2
                },
                {
                    "type": "flag",
                    "target": "inspected_pillar",
                    "value": true
                }
            ]
        },
        {
            "label": "Leave before the headache gets worse",
            "next_scene": "trailhead"
        },
        {
            "label": "[Empathy (Hard)] Open yourself to the silence",
            "check": {
                "skill": "Empathy",
                "dc": 12
            },
            "next_scene": "scene_clearing_peace",
            "on_fail_scene": "scene_clearing_dread"
        }
    ]
}