{
    "id": "woods_clearing",
    "title": "The Whispering Clearing",
    "location_id": "woods",
    "time_cost": 10,
    "text": {
        "base": "The forest floor drops away into a bowl of dead earth. No birdsong. No insect hum. Just a pressure against the eardrums, like deep water. In the center, the stone pillar stands not like a ruin, but like a bone pushed up through the skin of the world.",
        "lens": {
            "believer": "The silence isn't empty; it's holding its breath. The trees lean inward, a jury of twisted wood waiting for a verdict. The pillar is a lightning rod for things that don't have names.",
            "skeptic": "Geiger counter would likely scream here. The grass pattern suggests a localized die-off from subsurface leakage. The pillar? Old survey marker, likely granite, heavily weathered by acid rain.",
            "haunted": "The light is wrong here. Grey and flat, like the fluorescent tubes in the Psych Ward hallway. You can smell the antiseptic ghost of that place rising from the dirt."
        },
        "inserts": [
            {
                "condition": {
                    "skill_gte": {
                        "Perception": 4
                    }
                },
                "text": "The moss on the pillar hasn't grown over it; it's shying away. Leaving a gap of bare, grey stone.",
                "insert_at": "AFTER_BASE"
            }
        ]
    },
    "connected_scenes": [
        "trailhead",
        "woods_north_path"
    ],
    "objects": {
        "pillar": {
            "description": "It absorbs the light. Touching it feels like touching a fevered forehead—damp, and impossibly warm.",
            "interactions": {
                "use": "You press your palm to the stone. The warmth travels up your arm, settling in your teeth. A low thrum, like a generator beneath the earth."
            }
        },
        "grass": {
            "description": "Yellow. Brittle. It crunches like insect wings under your boots."
        }
    },
    "passive_clues": [
        {
            "clue_id": "clue_pillar_scratches",
            "visible_when": {
                "skill_gte": {
                    "Perception": 4
                }
            }
        }
    ],
    "ambient_effects": {
        "sanity_drain_per_min": 0.1,
        "paranoia_multiplier": 1.2
    },
    "memory_trigger": {
        "skill": "Subconscious",
        "dc": 14,
        "text": "A flash of memory: a child's laughter, abruptly cut off by a sound like tearing metal. You are standing in this exact spot, but the pillar is new and unblemished."
    },
    "choices": [
        {
            "label": "Inspect the pillar more closely",
            "next_scene": "woods_clearing",
            "effects": [
                {
                    "type": "sanity",
                    "value": -2
                },
                {
                    "type": "flag",
                    "target": "inspected_pillar",
                    "value": true
                }
            ]
        },
        {
            "label": "Walk back to the trailhead",
            "next_scene": "trailhead"
        },
        {
            "label": "[Empathy (Hard)] Close your eyes and feel the atmosphere",
            "check": {
                "skill": "Empathy",
                "dc": 12
            },
            "next_scene": "scene_clearing_peace",
            "on_fail_scene": "scene_clearing_dread"
        }
    ]
}